# StairsRuntypeHasMonolithicSupport Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairsRuntypeHasMonolithicSupport Property
ParameterTypeId Class See Also
---
"Monolithic Support": Monolithic Support
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairsRuntypeHasMonolithicSupport { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairsRuntypeHasMonolithicSupport As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairsRuntypeHasMonolithicSupport {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace